# GetTransform Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetTransform Method
FabricationPart Class See Also
---
Gets the transformation matrix of the fabrication part element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Transform GetTransform()
```

Visual Basic
---
```text
Public Function GetTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetTransform()
```

# ### Return Value
The transformation matrix of the fabrication part element.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace